AcDbCurve.setFromAcGeCurve(AcGeCurve3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcGeVector3d*,AcGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This function takes an AcGeCurve3d and sets this AcDbCurve to be
geometrically identical to the AcGeCurve3d.
geCurve: Input reference to an AcGeCurve3d.
normal: Optional normal vector.  If this parameter is
supplied then it must be a valid vector that is perpendicular to the
input geCurve, and this vector will become the normal vector of
the output pDbCurve.  If this parameter is not supplied, then this
function will compute the normal vector itself.
tol: Optional input tolerance.
Returns: Returns eOk if successful.

AcDbCurve.createFromAcGeCurve(AcGeCurve3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbCurve**!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcGeVector3d*,AcGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This function takes an AcGeCurve3d and returns an AcDbCurve that is
geometrically identical to the AcGeCurve3d.
geCurve: Input reference to an AcGeCurve3d.
pDbCurve: Output pointer to an AcDbCurve object that is
geometrically identical to geCurve.  The caller of this function is
responsible for deleting this AcDbCurve object or adding it to the
database.
normal: Optional normal vector.  If this parameter is
supplied then it must be a valid vector that is perpendicular to the
input geCurve, and this vector will become the normal vector of
the output pDbCurve.  If this parameter is not supplied, then this
function will compute the normal vector itself.
tol: Optional input tolerance.
Returns: Returns eOk if successful.

AcDbCurve.getAcGeCurve(AcGeCurve3d**!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This function returns an AcGeCurve3d that is geometrically identical to
this AcDbCurve.
pGeCurve: Output pointer to an AcGeCurve3d object that is
geometrically identical to this AcDbCurve.  The caller of this function
is responsible for deleting this AcGeCurve3d object.
tol: Optional input tolerance.
Returns: Returns eOk if successful.